case/precFlowSphere/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type           zeroGradient;
        value          $internalField;
    }
    outlet
    {
        type           zeroGradient;
        value          $internalField;

    }
    wall
    {
        type            zeroGradient;
        value           $internalField;
    }
    sphere
    {
        type            fixedValue;
        value           uniform 300;
    }
//    frontAndBack
//    {
//        type           zeroGradient;
//        value           $internalField;
//    }
//    back
//    {
//        type           zeroGradient;
//	value	       $internalField;
//    }

}

// ************************************************************************* //
