case/precFlowSphere/0/diffCo.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      diffCo;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1E-6;

boundaryField
{
    inlet
    {
        type           zeroGradient;
    }
    outlet
    {
        type           zeroGradient;

    }
    wall
    {
        type           zeroGradient;
    }
    sphere
    {
        type           zeroGradient;
    }
//    frontAndBack
//    {
//        type           zeroGradient;
//    }
//    back
//    {
//        type           zeroGradient;
//    }
}

// ************************************************************************* //
