case/precFlowSphere/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.solid     0
    volScalarFieldValue alpha.liquid    1
);

regions
(
    boxToCell
    {
        box (-0.0001 -0.0001 0) (0.0001 0.0001 0.0011);
        fieldValues
        (
            volScalarFieldValue alpha.solid     1
	        volScalarFieldValue alpha.liquid    0
	        volScalarFieldValue C               0 
        );
    }
);


// ************************************************************************* //
